In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.DataFrame()

In [3]:
print(df)

Empty DataFrame
Columns: []
Index: []

In [4]:
df1=pd.DataFrame([[1,2,3,4],[3,4,5,6],[6,7,8,9],[3,4,56,7,8]])

In [5]:
df1

   0  1   2  3    4
0  1  2   3  4  NaN
1  3  4   5  6  NaN
2  6  7   8  9  NaN
3  3  4  56  7  8.0

In [6]:
df1.head(3)

   0  1  2  3   4
0  1  2  3  4 NaN
1  3  4  5  6 NaN
2  6  7  8  9 NaN

In [7]:
df1.tail(3)

   0  1   2  3    4
1  3  4   5  6  NaN
2  6  7   8  9  NaN
3  3  4  56  7  8.0

In [9]:
df1.shape

(4, 5)

In [10]:
df1.iloc[1,2]

5

In [11]:
df1.iloc[0:2,0:2]

   0  1
0  1  2
1  3  4

In [12]:
df1.iloc[1:3,1:3]

   1  2
1  4  5
2  7  8

In [18]:
df1=pd.DataFrame([[1,2,3,4],[3,4,5,6],[6,7,8,9],[3,4,56,7,]],columns=['A','B','C','D'])

In [19]:
df1

   A  B   C  D
0  1  2   3  4
1  3  4   5  6
2  6  7   8  9
3  3  4  56  7